TestCase/sineWave/05-sineWave-rk4-wjq-NSCBC/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
       type            velocityOutletNSCBCx;
        field U;
        pInf            101325;
        gamma           1.4;
        etaAc           1;
        fieldInf        (-1 0 0);
        lInf            2.25;
        value           uniform (0 0 0);

  }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
